import random


one =  ("┌─────────┐",
        "│         │",
        "│    ●    │",
        "│         │",
        "└─────────┘"
        )

two =  ("┌─────────┐",
        "│ ●       │",
        "│         │",
        "│       ● │",
        "└─────────┘"
        )
three =("┌─────────┐",
        "│    ●    │",
        "│         │",
        "│ ●     ● │",
        "└─────────┘"
        )
four = ("┌─────────┐",
        "│ ●     ● │",
        "│         │",
        "│ ●     ● │",
        "└─────────┘"
        )
five = ("┌─────────┐",
        "│ ●     ● │",
        "│    ●    │",
        "│ ●     ● │",
        "└─────────┘"
        )
six =  ("┌─────────┐",
        "│ ●     ● │",
        "│ ●     ● │",
        "│ ●     ● │",
        "└─────────┘"
        )



num = input("Roll the Dice..🎲 (Y/N)>>").lower()

dice = (one, two, three, four, five, six)

while num =='y':
    result = random.choice(dice)
    for x in result:
        print(x,end='\n')
    num = input("Roll the Dice again..🎲 (Y/N)>>").lower()

    if num == 'n':
        print("Thanks for Playing!")
    elif num != 'y' and  num != 'n':
        print("Invalid input..❌")
        num = input("Roll the Dice again..🎲 (Y/N)>>").lower()

















